//$ Створити розмітку з двома текстовими полями та кнопкою. При натисканні на кнопку перевіряти, чи обидва поля містять значення, якщо так, то виводити повідомлення "Обидва поля заповнені", якщо ні — "Не всі поля заповнені".

const warte = prompt("Введи якусь циферку").trim().toLowerCase();
console.log(warte);

switch ("") {
  case warte:
    alert("Ейй, поле пусте!");
    break;

  default:
    alert(`Ти вів ${warte}`);
    break;
}

//$ Створити розмітку з двома числовими полями та кнопкою. При натисканні на кнопку перевіряти, чи сума значень полів більша за 10, якщо так, то виводити повідомлення "Сума більша за 10", якщо ні — "Сума менша або дорівнює 10".

const warte2 = prompt("Введіть якесь число").trim();
console.log(warte2);

const total = warte2;
if (total >= 10) {
  alert(`Сума більша за 10`);
} else {
  alert("Сума менша або дорівнює 10");
}

//$ Створити розмітку з текстовим полем та кнопкою. При натисканні на кнопку перевіряти, чи введений текст містить слово "JavaScript", якщо так, то виводити повідомлення "Текст містить слово JavaScript", якщо ні — "Текст не містить слово JavaScript".

const warte3 = prompt("Введіть слово JavaScript").trim().toLowerCase();
console.log(warte3);

const checkwarte3 = warte3.includes("javascript");
if (checkfield3 === true) {
  alert("текст містить слово JavaScript");
} else {
  alert("Текст не містить слово JavaScript");
}

//$ Створити розмітку з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введене число більше за 10 та менше за 20, якщо так, то виводити повідомлення "Число входить в діапазон від 10 до 20", якщо ні — "Число не входить в діапазон від 10 до 20".

const number = +prompt(
  "Введіть число яке входить в діапазон від 10 до 20"
).trim();
console.log(number);

if (number >= 10 && number <= 20) {
  alert("Ваше число входить в діапазон");
} else {
  alert("Ваше число не входить в діапазон");
}

//$ Створити розмітку з формою з полями введення та кнопкою. При натисканні на кнопку перевіряти, чи введені дані правильно заповнені, якщо так, то перенаправляти на іншу сторінку, якщо ні — виводити повідомлення про помилку. Правильно заповнені дані: ім'я містить не менше 3 символів, email містить символ @ та крапку після неї, пароль містить не менше 6 символів.

const userName = prompt("Введіть ваше ім'я").trim();
console.log(userName);

if (userName.length < 3) {
    alert("Помилка! Ваше ім'я коротке!")
}

const userEmail = prompt("Введіть ваш email").trim();
console.log(userEmail);


if (userEmail.includes("@")) {
    
} else {
    alert("Ви ввели некоректний email!")
}

const password = prompt("Введіть ваш пороль (не менше 6 символів)").trim();
console.log(password);

if (password.length < 6) {
    alert("Помилка! Ваш пороль занадто короткий!")
} else {
    alert("Дякуємо за ваші дані!")
}